trunk/bambinome_joel/Services/DivingBookingCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:div="http://j2ee.netbeans.org/wsdl/HotelModule/DivingBooking" xmlns:exc="http://xml.netbeans.org/schema/Exchanges">
  <soapenv:Body>
    <div:DivingBookingOperation>
      <ScubaDivingRequest>
        <exc:guestName>Bambinome</exc:guestName>
        <exc:roomNumber>42</exc:roomNumber>
        <exc:requestDate>2008-09-29</exc:requestDate>
        <exc:numberOfDivers>3</exc:numberOfDivers>
        <exc:lunchInclued>true</exc:lunchInclued>
        <exc:interest>
          <exc:Caves>string</exc:Caves>
          <exc:Dolphins>string</exc:Dolphins>
          <exc:Sharks>string</exc:Sharks>
          <exc:Wrecks>string</exc:Wrecks>
        </exc:interest>
      </ScubaDivingRequest>
    </div:DivingBookingOperation>
  </soapenv:Body>
</soapenv:Envelope>